Repository: pypi-data/pypi-mirror-120
Catalog: packages/planning-poker-jira/planning_poker_jira-1.0.0-py2.py3-none-any.whl/planning_poker_jira/locale/*/LC_MESSAGES/django.po
Languages: de

source: "{story}" could not be exported. {reason}
de: "{story}" konnte nicht exportiert werden. {reason}

source: %d story was successfully exported.
de: %d Story wurde erfolgreich exportiert.

source: Override Options
de: Optionen überschreiben

source: Export Story Points
de: Storypunkte exportieren

source: Import
de: Importieren

source: Import Stories
de: Stories importieren

source: %d story was successfully imported.
de: %d Story wurde erfolgreich importiert.

source: Import stories from "{connection}"
de: Stories aus "{connection}" importieren

source: Export Story Points to Jira
de: Storypunkte zu Jira exportieren

source: Planning Poker: Jira Extension
de: Planungspoker: Jira-Erweiterung

source: Username
de: Benutzername

source: You can use this to override the username saved in the database
de: Benutzen Sie dieses Feld um den Benutzernamen aus der Datenbank zu überschreiben

source: Password
de: Passwort

source: You can use this to override the password in the database
de: Benutzen Sie dieses Feld um das Passwort aus der Datenbank zu überschreiben

source: Missing credentials. Check whether you entered an API URL, and a username.
de: Fehlende Anmeldedaten. Überprüfen Sie, ob Sie eine API URL und einen Benutzernamen angegeben haben.

source: Test Connection
de: Verbindung überprüfen

source: Check this if you want to test your entered data and try to authenticate against the API
de: Nutzen Sie diese Option, wenn Sie versuchen wollen sich mit den eingegebenen Daten bei der API zu authentifizieren

source: Delete Password
de: Passwort löschen

source: Check this if you want to delete your saved password
de: Nutzen Sie diese Option, wenn Sie Ihr gespeichertes Passwort löschen wollen

source: Use this to override the password or leave it blank to make no changes
de: Benutzen Sie dieses Feld um das Passwort aus der Datenbank zu überschreiben oder lassen Sie es leer um keine Änderungen daran vorzunehmen

source: You can not change the password and delete it at the same time
de: Sie können das Passwort nicht gleichzeitig ändern und löschen

source: Jira Connection
de: Jira-Verbindung

source: The Jira Backend to which the story points should be exported. The points for any stories which are not present in the backend can not be exported
de: Der Jira-Server zu dem die Storypunkte exportiert werden sollen. Die Punkte aller Stories, die nicht im Server vorhanden sind können nicht exportiert werden

source: Poker Session
de: Poker-Runde

source: The poker session to which the imported stories should be added
de: Die Poker-Runde zu der die importieren Stories hinzugefügt werden sollen

source: Label
de: Bezeichnung

source: API Username
de: API Benutzername

source: Story Points Field
de: Storypunktefeld

source: Jira Connections
de: Jira-Verbindungen

source: Are you sure you want to export the points for the selected story?
de: Sind Sie sicher, dass Sie die Punkte für die ausgewählte Story exportieren wollen?

source: Export
de: Exportieren

source: No, take me back
de: Abbrechen

source: Failed to connect to server.
de: Es konnte keine Verbindung zum Server hergestellt werden.

source: Is "{api_url}" the correct API URL?
de: Ist "{api_url}" die korrekte API URL?

source: There was an ambiguous error with your request. Check if all your data is correct.
de: Es gab einen uneindeutigen Fehler mit Ihrer Anfrage. Überprüfen Sie, ob alle Ihre Daten korrekt sind.

source: Encountered an unknown exception.
de: Es ist ein unbekannter Fehler aufgetreten.

source: Could not authenticate the API user with the given credentials. Make sure that you entered the correct data.
de: Ein API Nutzer mit den gegebenen Anmeldedaten konnte nicht authentifiziert werden. Überprüfen Sie, ob Sie die korrekten Daten eingegeben haben.

source: The story does probably not exist inside "{connection}".
de: Die Story existiert vermutlich nicht in "{connection}".

source: The story does probably not exist inside the selected backend.
de: Die Story existiert vermutlich nicht im ausgewählten Backend.

source: Received status code {status_code}.
de: Statuscode {status_code} erhalten.
