import random
lyrics = ['寫信告訴我今天 海是什麼顏色\n',
	 '夜夜陪著你的海 心情又如何\n',
	 '灰色是不想說 藍色是憂鬱\n',
	 '而漂泊的你 狂浪的心 停在哪裡\n',
	 '寫信告訴我今夜 你想要夢什麼\n',
	 '夢裡外的我是否 都讓你無從選擇\n',
	 '我揪著一顆心 整夜都閉不了眼睛\n',
	 '為何你明明動了情 卻又不靠近\n',
	 '聽 海哭的聲音\n',
	 '嘆惜著誰又被傷了心 卻還不清醒\n',
	 '一定不是我 至少我很冷靜\n',
	 '可是淚水 就連淚水也都不相信\n',
	 '聽 海哭的聲音\n',
	 '這片海未免也太多情 悲泣到天明\n',
	 '寫封信給我 就當最後約定\n',
	 '說你在離開我的時候 是怎樣的心情\n',
	 '寫信告訴我今夜 你想要夢什麼\n',
	 '夢裡外的我是否 都讓你無從選擇\n',
	 '我揪著一顆心 整夜都閉不了眼睛\n',
	 '為何你明明動了情 卻又不靠近\n',
	 '聽 海哭的聲音\n',
	 '嘆惜著誰又被傷了心 卻還不清醒\n',
	 '一定不是我 至少我很冷靜\n',
	 '可是淚水 就連淚水也都不相信\n',
	 '聽 海哭的聲音\n',
	 '這片海未免也太多情 悲泣到天明\n',
	 '寫封信給我 就當最後約定\n',
	 '說你在離開我的時候 是怎樣的心情']

chats = ['Hi，哈喽，你好。。。\n',
		 '烦恼是自找，快乐是忘怀\n',
		 '我是专门来查户口的\n',
		 '我今天收到了一个快递，商家竟然调皮地给我包装套包装，连着弄了3层\n',
		 '看你朋友圈发现你是个吃货哦\n',
		 '你知道社团要怎么申请吗？\n',
		 '你知道吉他的和弦怎么按吗？\n',
		 '你知道小提琴要学几年吗？\n',
		 '你昨天居然出现在我梦里了\n',
		 '和你说话你都不理我，你是不是不会打字呀']

def intro(*args):
	print("恭喜你解锁了duxueyuan.intro()函数!")
	print("我还有许多功能，你可以来试一试:\n")
	print("聊天: duxueyuan.speak()\n唱歌: duxueyuan.sing()\n算算数: duxueyuan.calculate(1+1)\n")
	print("提示: 可以使用上下方向键或者复制粘贴快速运行之前的命令哦，在唱歌部分会很有用")

def sing(*args):
	print("我想唱歌!")
	print(random.choice(lyrics))

def speak(*args):
	print("让我们来聊天吧!")
	print(random.choice(chats))

def calculate(x):
	print("我数学不错呢!")
	try:
		if isinstance(x, float) or isinstance(x, int):
			pass
		else:
			x = eval(x)
	except:
		print("但是不好意思，这题我不会")
	else:
		print(x)
		print("我算的对不对？")	
	return x

