Repository: pypi-data/pypi-mirror-120
Catalog: packages/Red-DiscordBot/Red_DiscordBot-3.4.14-py3-none-any.whl/redbot/cogs/mutes/locales/*.po
Languages: ru_ru

source: That user is already muted in this channel.
ru_ru: Этот пользователь уже заглушен в этом канале.

source: That user is not muted in this channel.
ru_ru: Этот пользователь не заглушен в этом канале.

source: I cannot let you do that. You are not higher than the user in the role hierarchy.
ru_ru: Я не могу позволить вам сделать это. Ваша роль ниже роли пользователя в иерархии.

source: I cannot let you do that. You are not higher than the mute role in the role hierarchy.
ru_ru: Я не могу позволить вам сделать это. Вы не выше роли mute в иерархии ролей.

source: That user cannot be (un)muted, as they have the Administrator permission.
ru_ru: Этот пользователь не может быть (не)заглушен, так как у него есть права администратора.

source: Failed to mute or unmute user. I need the Manage Roles permission and the user I'm muting must be lower than myself in the role hierarchy.
ru_ru: Не удалось отключить или включить звук пользователя. Мне нужно разрешение Управление ролями, а пользователь, которого я отключаю, должен быть ниже меня в иерархии ролей.

source: Failed to mute or unmute user. I need the Manage Permissions permission.
ru_ru: Не удалось отключить или включить звук с пользователя. Мне нужно разрешение Управление ролями.

source: The user has left the server while applying an overwrite.
ru_ru: Пользователь покинул сервер во время применения перезаписи.

source: The channel I tried to mute or unmute the user in isn't found.
ru_ru: Канал, на котором я пытался отключить или включить звук пользователя, не найден.

source: The mute role no longer exists.
ru_ru: Роль отключения звука больше не существует.

source: Because I don't have the Move Members permission, this will take into effect when the user rejoins.
ru_ru: Поскольку у меня нет разрешения Переместить Участников, оно вступит в силу, когда пользователь снова присоединится.

source: Mute users temporarily or indefinitely.
ru_ru: Временно или бессрочно отключать пользователей.

source: Automatic unmute
ru_ru: Автовключение звука

source: Server unmute
ru_ru: Включение звука сервера

source: I am unable to unmute {user} for the following reason: {reason}
ru_ru: Я не могу включить звук {user} по следующей причине: {reason}

source: Unmuted in channels:
ru_ru: Неприглушенные каналы:

source: {member} could not be unmuted for the following reasons:
ru_ru: {member} не может быть отключен по следующим причинам:

source: {reason} In the following channels: {channels}
ru_ru: {reason} В следующих каналах: {channels}

source: Voice unmute
ru_ru: Включить звук голоса

source: Channel unmute
ru_ru: Включить звук канала

source: I am unable to unmute {user} in {channel} for the following reason: {reason}
ru_ru: Я не могу включить звук {user} в {channel} по следующей причине: {reason}

source: Unknown
ru_ru: Неизвестный

source: No reason provided.
ru_ru: Причина не указана.

source: Until
ru_ru: До

source: Duration
ru_ru: Длительность

source: Guild
ru_ru: Гильдия

source: Moderator
ru_ru: Модератор

source: **Moderator**: {moderator}
ru_ru: **Модератор**: {moderator}

source: **Until**: {until} **Duration**: {duration}
ru_ru: **До**: {until} **Продолжительность**: {duration}

source: **Guild**: {guild_name}
ru_ru: **Гильдия**: {guild_name}

source: Manually removed mute role
ru_ru: Ручное удаление роли отключения звука

source: Manually applied mute role
ru_ru: Роль отключения звука, применяемая вручную

source: Server mute
ru_ru: Отключение звука на сервере

source: Manually removed channel overwrites
ru_ru: Перезапись каналов, удаленных вручную

source: Previously muted in this server.
ru_ru: Ранее отключенный звук на этом сервере.

source: Mute settings.
ru_ru: Настройки отключения звука.

source: Set whether mute notifications should be sent to users in DMs.
ru_ru: Установите, следует ли отправлять уведомления о выключении звука пользователям в ЛС-сообщениях.

source: I will now try to send mute notifications to users DMs.
ru_ru: Теперь я постараюсь отправлять уведомления о выключении звука в ЛС пользователей.

source: Mute notifications will no longer be sent to users DMs.
ru_ru: Уведомления о выключении звука больше не будут отправляться в ЛС пользователей.

source: Decide whether the name of the moderator muting a user should be included in the DM to that user.
ru_ru: Определяет, должно ли имя модератора, отключившего пользователя, быть включено в сообщение ЛС этому пользователю.

source: I will include the name of the moderator who issued the mute when sending a DM to a user.
ru_ru: Я буду указывать имя модератора, который отключил звук, при отправке ЛС пользователю.

source: I will not include the name of the moderator who issued the mute when sending a DM to a user.
ru_ru: Я не буду указывать имя модератора, который отключил звук, при отправке ЛС пользователю.

source: Whether or not to force role only mutes on the bot
ru_ru: Должно ли принудительно заглушать роль только на бота

source: Okay I will enforce role mutes before muting users.
ru_ru: Хорошо, я буду принудительно отключать роли, прежде чем отключать пользователей.

source: Okay I will allow channel overwrites for muting users.
ru_ru: Хорошо, я разрешу перезаписывать канал для заглушенных пользователей.

source: Shows the current mute settings for this guild.
ru_ru: Показывает текущие настройки отключения звука для этой гильдии.

source: Mute Role: {role} Notification Channel: {channel} Default Time: {time} Send DM: {dm} Show moderator: {show_mod}
ru_ru: Роль отключения звука: {role} Канал уведомления: {channel} Время по умолчанию: {time} Отправить в ЛС: {dm} Показать модератора: {show_mod}

source: None
ru_ru: Нет

source: Set the notification channel for automatic unmute issues. If no channel is provided this will be cleared and notifications about issues when unmuting users will not be sent anywhere.
ru_ru: Установите канал уведомления для автоматической разблокировки звука. Если канал не указан, он будет очищен, и уведомления о проблемах с отключением звука пользователей не будут отправляться никуда.

source: Notification channel for unmute issues has been cleared.
ru_ru: Канал уведомлений о проблемах, связанных с отключением звука, был очищен.

source: I will post unmute issues in {channel}.
ru_ru: Я буду публиковать сообщения о включении звука на {channel}.

source: Sets the role to be applied when muting a user. If no role is setup the bot will attempt to mute a user by setting channel overwrites in all channels to prevent the user from sending messages. Note: If no role is setup a user may be able to leave the server and rejoin no longer being muted.
ru_ru: Устанавливает роль, которая будет применяться при отключении звука у пользователя. Если роль не задана, бот попытается отключить пользователя, установив перезапись каналов во всех каналах, чтобы пользователь не мог отправлять сообщения. Примечание: Если роль не установлена, пользователь может покинуть сервер и снова зайти на сервер без отключения звука.

source: Channel overwrites will be used for mutes instead.
ru_ru: Перезапись каналов будет использоваться для отключения звука.

source: You can't set this role as it is not lower than you in the role hierarchy.
ru_ru: Вы не можете установить эту роль, поскольку она не ниже вас в иерархии ролей.

source: Mute role set to {role}
ru_ru: Роль отключения звука установлена на {role}

source: No notification channel has been setup, use {command_1} to be updated when there's an issue in automatic unmutes.
ru_ru: Канал уведомления не настроен, используйте {command_1} для получения обновлений при возникновении проблем с автоматическим включением звука.

source: Create a Muted role. This will create a role and apply overwrites to all available channels to more easily setup muting a user. If you already have a muted role created on the server use `[p]muteset role ROLE_NAME_HERE`
ru_ru: Создайте роль с приглушенным звуком. Это позволит создать роль и применить перезапись ко всем доступным каналам для более простой настройки отключения звука для пользователя. Если у вас уже есть роль отключения звука, созданная на сервере, используйте `[p]muteset role ROLE_NAME_HERE`

source: There is already a mute role setup in this server. Please remove it with {command} before trying to create a new one.
ru_ru: На этом сервере уже установлена роль mute. Пожалуйста, удалите ее с помощью {command}, прежде чем пытаться создать новую.

source: Mute role setup
ru_ru: Настройка роли отключения звука

source: I could not create a muted role in this server.
ru_ru: Я не смог создать заглушенную роль на этом сервере.

source: I could not set overwrites for the following channels: {channels}
ru_ru: Я не смог установить перезапись для следующих каналов: {channels}

source: Set the default mute time for the mute command. If no time interval is provided this will be cleared.
ru_ru: Установите время отключения звука по умолчанию для команды отключения звука. Если временной интервал не указан, он будет очищен.

source: Default mute time removed.
ru_ru: Время отключения звука по умолчанию удалено.

source: Please provide a valid time format.
ru_ru: Пожалуйста, укажите правильный формат времени.

source: Default mute time set to {time}.
ru_ru: Время отключения звука по умолчанию установлено на {time}.

source: This server does not have a mute role setup. You can setup a mute role with `{command_1}` or`{command_2}` if you just want a basic role created setup.
ru_ru: На этом сервере не настроена роль отключения звука. Вы можете настроить роль отключения звука с помощью `{command_1}` или `{command_2}`, если вам нужна только базовая настройка роли.

source: Channel overwrites for muting users can get expensive on Discord's API as such we recommend that you have an admin setup a mute role instead. Channel overwrites will also not re-apply on guild join, so a user who has been muted may leave and re-join and no longer be muted. Role mutes do not have this issue. Are you sure you want to continue with channel overwrites?
ru_ru: Перезапись канала для отключения пользователей может быть дорогостоящей для API Discord, поэтому мы рекомендуем, чтобы администратор установил роль отключения вместо этого. Перезапись канала также не будет повторно применяться при вступлении в гильдию, поэтому пользователь, который был отключен, может уйти и снова вступить в гильдию и больше не будет отключен. Роль отключения звука не имеет такой проблемы. Вы уверены, что хотите продолжать использовать перезапись каналов?

source: Reacting with ✅ will continue the mute with overwrites and stop this message from appearing again, Reacting with ❎ will end the mute attempt.
ru_ru: Реакция ✅ продолжит отключение звука с перезаписью и остановит повторное появление этого сообщения, Реакция ❎ завершит попытку отключения звука.

source: Saying `yes` will continue the mute with overwrites and stop this message from appearing again, saying `no` will end the mute attempt.
ru_ru: Если сказать `да`, вы продолжите отключение звука с перезаписью и остановите повторное появление этого сообщения, если сказать `нет`, попытка отключения звука будет прекращена.

source: OK then.
ru_ru: Хорошо, тогда.

source: Displays active mutes on this server.
ru_ru: Отображает активные отключения звука на этом сервере.

source: __Server Mutes__
ru_ru: __Сервер отключает звук__

source: __<#{channel_id}> Mutes__
ru_ru: __<#{channel_id}> Приглушает звук__

source: There are no mutes on this server right now.
ru_ru: На этом сервере пока нет заглушений.

source: Mute users. `<users...>` is a space separated list of usernames, ID's, or mentions. `[time_and_reason]` is the time to mute for and reason. Time is any valid time length such as `30 minutes` or `2 days`. If nothing is provided the mute will use the set default time or indefinite if not set. Examples: `[p]mute @member1 @member2 spam 5 hours` `[p]mute @member1 3 days`
ru_ru: Отключить пользователей. `<users...>` - это список имен пользователей, ID или упоминаний, разделенных пробелами. `[time_and_reason]` - время отключения звука и причина. Время - это любой допустимый отрезок времени, например, `30 минут` или `2 дня`. Если ничего не не указано, отключение звука будет происходить на время, установленное по умолчанию, или на неопределенное время, если оно не установлено. Примеры: `[p]mute @member1 @member2 spam 5 hours` `[p]mute @member1 3 дня`

source: You cannot mute me.
ru_ru: Вы не можете отключить мне звук.

source: You cannot mute yourself.
ru_ru: Вы не можете отключить себе звук.

source: for {duration}
ru_ru: для {duration}

source: {users} has been muted in this server{time}.
ru_ru: {users} был заглушен на этом сервере{time}.

source: {users} have been muted in this server{time}.
ru_ru: {users} были отключены на этом сервере{time}.

source: {member} could not be (un)muted for the following reasons:
ru_ru: {member} не может быть (не)отключен по следующим причинам:

source: - {reason} In the following channels: {channels}
ru_ru: - {reason} в следующих каналах: {channels}

source: Some users could not be properly muted. Would you like to see who, where, and why?
ru_ru: Некоторым пользователям не удалось правильно отключить звук. Вы хотите увидеть, кто, где и почему?

source: Mute a user in the current text channel. `<users...>` is a space separated list of usernames, ID's, or mentions. `[time_and_reason]` is the time to mute for and reason. Time is any valid time length such as `30 minutes` or `2 days`. If nothing is provided the mute will use the set default time or indefinite if not set. Examples: `[p]mutechannel @member1 @member2 spam 5 hours` `[p]mutechannel @member1 3 days`
ru_ru: Отключить звук пользователя в текущем текстовом канале. `<users...>` - список имен пользователей, идентификаторов или упоминаний, разделенных пробелами. `[time_and_reason]` - время отключения звука и причина. Время - это любой допустимый отрезок времени, например, `30 минут` или `2 дня`. Если ничего не не указано, отключение звука будет происходить на время, установленное по умолчанию, или на неопределенное время, если оно не установлено. Примеры: `[p]mutechannel @member1 @member2 spam 5 hours` `[p]mutechannel @member1 3 дня`

source: Channel mute
ru_ru: Канал заглушен

source: {users} has been muted in this channel{time}.
ru_ru: {users} был заглушен в этом канале{time}.

source: {users} have been muted in this channel{time}.
ru_ru: {users} были заглушены в этом канале{time}.

source: The following users could not be muted
ru_ru: Следующие пользователи не могут быть заглушены

source: Unmute users. `<users...>` is a space separated list of usernames, ID's, or mentions. `[reason]` is the reason for the unmute.
ru_ru: Включить пользователей. `<users...>` - это список имен пользователей, идентификаторов или упоминаний, разделенных пробелами. `[reason]` - причина отключения звука.

source: You cannot unmute me.
ru_ru: Вы не можете включить мне звук.

source: You cannot unmute yourself.
ru_ru: Вы не можете включить себе звук.

source: {users} unmuted in this server.
ru_ru: {users} включены на этом сервере.

source: Unmute a user in this channel. `<users...>` is a space separated list of usernames, ID's, or mentions. `[reason]` is the reason for the unmute.
ru_ru: Включите пользователя в этом канале. `<users...>` - список имен пользователей, идентификаторов или упоминаний, разделенных пробелами. `[reason]` - причина включения звука.

source: {users} unmuted in this channel.
ru_ru: {users} включены на этом канале.

source: The following users could not be unmuted
ru_ru: Следующие пользователи не могут быть размучены

source: That user is not in a voice channel.
ru_ru: Этот пользователь не в голосовом канале.

source: I require the {perms} permission(s) in that user's channel to do that.
ru_ru: Мне требуется право(а) {perms} в канале пользователя чтобы сделать это.

source: You must have the {perms} permission(s) in that user's channel to use this command.
ru_ru: Вы должны иметь право(а) {perms} в канале пользователя для выполнения этой команды.

source: Mute a user in their current voice channel. `<users...>` is a space separated list of usernames, ID's, or mentions. `[time_and_reason]` is the time to mute for and reason. Time is any valid time length such as `30 minutes` or `2 days`. If nothing is provided the mute will use the set default time or indefinite if not set. Examples: `[p]voicemute @member1 @member2 spam 5 hours` `[p]voicemute @member1 3 days`
ru_ru: Отключить звук пользователя в его текущем голосовом канале. `<users...>` - это список имен пользователей, идентификаторов или упоминаний, разделенных пробелами. `[time_and_reason]` - время отключения звука и причина. Время - это любой допустимый отрезок времени, например, `30 минут` или `2 дня`. Если ничего не не указано, отключение звука будет происходить на время, установленное по умолчанию, или на неопределенное время, если оно не установлено. Примеры: `[p]voicemute @member1 @member2 spam 5 hours` `[p]voicemute @member1 3 дня`

source: Voice mute
ru_ru: Отключение звука голоса

source: Unmute a user in their current voice channel. `<users...>` is a space separated list of usernames, ID's, or mentions. `[reason]` is the reason for the unmute.
ru_ru: Включить пользователя в его текущем голосовом канале. `<users...>` - список имен пользователей, идентификаторов или упоминаний, разделенных пробелами. `[reason]` - причина включение звука.
